dot_doom.d/config.org
#+TITLE: Doom Emacs Configuration
#+LAST_MODIFIED: [2021-04-07 Wed 07:59]
#+startup: fold
#+property: header-args:emacs-lisp :tangle yes :cache yes :results silent :comments link
#+property: header-args :tangle no :results silent

This liberate configuration for [[https://github.com/hlissner/doom-emacs][Doom Emacs]] is inspired by (aka. stolen from) [[https://tecosaur.github.io/emacs-config/config.html][tecosaur]].

* Prerequisites

** Install necessary softwares

#+begin_src shell
brew install tidy-html5   # format html
brew install clang-format # format c/cpp
brew install stfmt        # format shell
#+end_src

** Refresh environment
#+begin_src shell
doom env refresh
#+end_src

** Install

#+begin_src emacs-lisp :tangle no
(pdf-tools-install)      ;; for pdftools
(plantuml-download-jar)  ;; for plantuml
(irony-install-server)   ;; for c/c++
#+end_src

#+begin_src bash
cmake -DCMAKE_INSTALL_PREFIX\=/Users/junwei/.emacs.d/.local/etc/irony-server/ -DLIBCLANG_LIBRARY\=/usr/local/opt/llvm/lib/libclang.dylib -DLIBCLANG_INCLUDE_DIR\=/usr/local/opt/llvm/include /Users/junwei/.emacs.d/.local/straight/build-27.1/irony/server && cmake --build . --use-stderr --config Release --target install
#+end_src

* Rudimentary configuration
:LOGBOOK:
CLOCK: [2021-02-16 Tue 11:40]
:END:
Make this file run (slightly) faster with lexical binding (see [[https://nullprogram.com/blog/2016/12/22/][this blog post]] for more info).

#+begin_src emacs-lisp :comments no
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!
#+end_src

** Personal Information
It's useful to have some basic personal information

#+begin_src emacs-lisp
;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Junwei Wang"
      user-mail-address "junwei.wang@cryptoexperts.com")
#+end_src

Apparently this is used by ~GPG~, and all sorts of other things.

** Appearance
:LOGBOOK:
CLOCK: [2021-01-08 Fri 10:25]--[2021-01-08 Fri 10:50] =>  0:25
:END:

#+begin_src emacs-lisp
;; if started by emacs command or desktop file
;; open emacs in fullscreen
;; (toggle-frame-maximized)
;; (if (eq initial-window-system 'x)
;;     (toggle-frame-maximized)
;;   (toggle-frame-maximized))

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
(setq doom-font (font-spec :family "JetBrains Mono" :size 16 :weight 'semi-light)
      doom-variable-pitch-font (font-spec :family "Overpass" :size 17)
      doom-big-font (font-spec :family "JetBrains Mono" :size 23 :weight 'semi-light)
      doom-serif-font (font-spec :family "IBM Plex Mono" :weight 'light))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :weight bold))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
(setq doom-theme 'doom-vibrant)

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)

;;;;;;;;;; beacon
(beacon-mode 1)
(setq beacon-color "#bf616a"
      beacon-size 80
      beacon-blink-delay 0.5
      beacon-blink-duration 0.5
      beacon-blink-when-focused t
      beacon-blink-when-point-moves-vertically t)
#+end_src

** Others

#+begin_src emacs-lisp
(setq projectile-project-search-path '("~/git/" "~/github/" "~/github-jwang/" "~/projects/" "~/workspace/"))

;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.

;;
;; global

;; basic settings
(setq-default delete-by-moving-to-trash t         ; Delete files to trash
              tab-width 4                         ; Set width for tabs
              uniquify-buffer-name-style 'forward ; Uniquify buffer names
              window-combination-resize t         ; take new window space from all other windows (not just current)
              x-stretch-cursor t)                 ; Stretch cursor to the glyph width

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
      auto-save-default t                         ; Nobody likes to loose work, I certainly don't
      inhibit-compacting-font-caches t            ; When there are lots of glyphs, keep them in memory
      truncate-string-ellipsis "…")               ; Unicode ellispis are nicer than "...", and also save /precious/ space

(delete-selection-mode 1)                         ; Replace selection when inserting text
(display-time-mode 1)                             ; Enable time in the mode-line
(unless (equal "Battery status not available"
               (battery))
  (display-battery-mode 1))                       ; On laptops it's nice to know how much power you have
(global-subword-mode 1)                           ; Iterate through CamelCase words

;; editing
(setq show-trailing-whitespace 1)
(add-hook 'before-save-hook 'delete-trailing-whitespace)

;;;;;;;;;;;;; spelling
;; overwriting the value set by doom
(setq ispell-dictionary "en_US"
      ispell-personal-dictionary "~/.aspell.en.pws")

;;;;;;;;;;; neotree
(setq neo-hidden-regexp-list '("^\\." "\\.cs\\.meta$"
                               ;; Python
                               "\\.pyc$" "__pycache__" "\\.egg-info"
                               "~$" "^#.*#$" "\\.elc$"
                               ;; Latex
                               "\\.aux$" "\\.synctex\\.gz$" "\\.fls$" "\\.tdo$" "\\.bbl$" "\\.blg$")
      neo-window-fixed-size nil)

;;;;;;;;;;;;;;; calendar
(setq calendar-week-start-day 1)

;;;;;;;;;;;;;;; format
(setq +format-on-save-enabled-modes
      '(not emacs-lisp-mode  ; elisp's mechanisms are good enough
            sql-mode         ; sqlformat is currently broken
            web-mode))
(setq-hook! 'web-mode-hook +format-with 'prettier-prettify)
#+end_src


** LaTeX

#+begin_src emacs-lisp
;;;;;;;;;; LaTeX
;; indentation
;; (after! tex
;;   (setq-default TeX-master nil))
(after! latex
  (setq LaTeX-indent-level 2
        LaTeX-item-indent -2
        ;;  TeX-error-overview-open-after-TeX-run t
        ))
(mapc (lambda (mode) (add-hook 'LaTeX-mode-hook mode))
      (list 'auto-fill-mode
            'display-fill-column-indicator-mode))
(add-hook 'TeX-mode-hook (lambda () (set-fill-column 100)))
#+end_src

** Web

#+begin_src emacs-lisp
;;;;;;;;;; Web
;; indentation
(setq web-mode-markup-indent-offset 2
      web-mode-code-indent-offset 2
      web-mode-css-indent-offset 2)
#+end_src

** Python

#+begin_src emacs-lisp
;;;;;;;;;; Python
(mapc (lambda (mode) (add-hook 'python-mode-hook mode))
      (list 'py-autopep8-enable-on-save
            'display-fill-column-indicator-mode))
(add-hook 'python-mode-hook #'py-autopep8-enable-on-save)
(set-formatter! 'autopep8 'py-autopep8 :modes '(python-mode))
;; (add-hook 'python-mode-hook (lambda () (set-fill-column 100)))
#+end_src

