dot_doom.d/config.org
** Org Mode

#+begin_src emacs-lisp
;;;;;;;;;; Orgmode
(setq org-directory "~/github/org/")
(setq org-image-actual-width nil)

;; (after! org
;;   (setq-local time-stamp-active t
;;               time-stamp-start "#\\+LAST_MODIFIED:[ \t]*"
;;               time-stamp-end "$"
;;               time-stamp-format "\[%Y-%02m-%02d %3a %02H:%02M\]")
;;   (add-hook 'before-save-hook 'time-stamp))

(add-hook 'org-mode-hook (lambda ()
                           (setq-local time-stamp-active t
                                       time-stamp-start "#\\+LAST_MODIFIED:[ \t]*"
                                       time-stamp-end "$"
                                       time-stamp-format "\[%Y-%02m-%02d %3a %02H:%02M\]")
                           (add-hook 'before-save-hook 'time-stamp nil 'local)))
#+end_src

*** Agenda

#+begin_src emacs-lisp
(setq org-agenda-custom-commands
      '(("B" "Biweekly Team Meeting"
         ((agenda "" ((org-agenda-span 14)
                      (org-agenda-start-day "-13d"))))
         ((org-agenda-compact-blocks t))) ;; options set here apply to the entire block
        ("x" ""
         ((agenda "" ((org-agenda-span 1))))
         ((org-agenda-compact-blocks t)))
        ))
#+end_src

*** Noter

#+begin_src emacs-lisp
(setq org-noter-always-create-frame nil)
#+end_src

*** LaTeX
#+begin_src emacs-lisp
;;;;;;;;;; Org LaTeX
;;; https://emacs.stackexchange.com/a/41187
;;;; (add-to-list 'org-latex-packages-alist "~/github/org/latex/mymacros.sty")
#+end_src

*** Org Roam

#+begin_src emacs-lisp
;;;;;;;;;; Org-Roam
(setq org-roam-capture-templates
      '(("d" "default" plain
         (function org-roam-capture--get-point)
         "%?"
         :file-name "%<%Y%m%d>-${slug}"
         :head "#+TITLE: ${title}\n#+CREATED: %U\n#+LAST_MODIFIED: %U\n#+ROAM_ALIAS:\n#+ROAM_TAGS:\n\n"
         :unnarrowed t)
        ("D" "default copy" plain
         (function org-roam-capture--get-point)
         "%?"
         :file-name "%<%Y%m%d%H%M%S>-${slug}"
         :head "#+TITLE: ${title}\n#+CREATED: %U\n#+LAST_MODIFIED: %U\n\n"
         :unnarrowed t)))

(setq org-roam-graph-viewer "/Applications/Firefox.app/Contents/MacOS/firefox")
(use-package! org-roam-server
  :config
  (setq org-roam-server-host "127.0.0.1"
        org-roam-server-port 8080
        org-roam-server-authenticate nil
        org-roam-server-export-inline-images t
        org-roam-server-serve-files nil
        org-roam-server-served-file-extensions '("pdf" "mp4" "ogv")
        org-roam-server-network-poll t
        org-roam-server-network-arrows nil
        org-roam-server-network-label-truncate t
        org-roam-server-network-label-truncate-length 60
        org-roam-server-network-label-wrap-length 20))

;; issue: https://github.com/org-roam/org-roam-server/issues/115
(defun org-roam-server-open ()
  "Ensure the server is active, then open the roam graph."
  (interactive)
  (smartparens-global-mode -1)
  (org-roam-server-mode 1)
  (browse-url-xdg-open (format "http://localhost:%d" org-roam-server-port))
  (smartparens-global-mode 1))

;; automatically enable server-mode
(after! org-roam
  (smartparens-global-mode -1)
  (org-roam-server-mode)
  (smartparens-global-mode 1)
  (org-roam-bibtex-mode))

;; (use-package! org-roam-bibtex
;;   :after org-roam
;;   :hook (org-roam-mode . org-roam-bibtex-mode))

(setq orb-preformat-keywords '("year" "citekey" "title" "author")
      orb-templates '(("r" "ref" plain (function org-roam-capture--get-point)
                       (file "~/github/org/templates/orb.org")
                       :file-name "biblio/${citekey}"
                       :head "#+TITLE: ${year} - [${citekey}] - ${title} -- ${author}\n"
                       :unnarrowed t)))

;;;;;;;;; Bibliography
;;; helm-bibtex
(setq bibtex-completion-bibliography '("~/.cb/cryptobib/crypto.bib"
                                       "~/github/org/biblio/thesis.bib"
                                       "~/github/org/biblio/book.bib"
                                       "~/github/org/biblio/misc.bib"
                                       "~/github/org/biblio/temp.bib"
                                       "~/github/org/biblio/tifs.bib"
                                       "~/github/org/biblio/crxwork/wheely.bib")
      bibtex-completion-library-path '("~/github/org/biblio/pdfs"))

;;; org-ref
(setq reftex-default-bibliography bibtex-completion-bibliography
      ;; show broken links is slow in large files
      org-ref-show-broken-links nil)

;; org-ref
(setq org-ref-completion-library 'org-ref-ivy-cite)

;; see org-ref for use of these variables
(setq org-ref-bibliography-notes "~/github/org/biblio/notes.org"
      org-ref-default-bibliography bibtex-completion-bibliography
      org-ref-pdf-directory "~/github/org/biblio/pdfs")

;;;;;;;;;; Org-Noter
(setq org-noter-notes-search-path '(org-directory
                                    "~/github/org/roam/biblio"))
#+end_src

