dot_doom.d/config.org
** Email

#+begin_src emacs-lisp
;;;;;;;;; MU4E
(setq mu4e-maildir (expand-file-name "~/.mbsync"))
(setq +mu4e-mu4e-mail-path (expand-file-name "~/.mbsync"))

(after! mu4e
  ;; get mail
  (setq
   ;; mu4e-get-mail-command "mbsync -c ~/.mbsyncrc -a"
   ;; mu4e-html2text-command "w3m -T text/html" ;;using the default mu4e-shr2text
   mu4e-view-prefer-html t
   mu4e-update-interval 180
   mu4e-headers-auto-update t
   ;; mu4e-compose-signature-auto-include nil
   mu4e-compose-format-flowed t)
  (add-to-list 'mu4e-view-actions
               '("ViewInBrowser" . mu4e-action-view-in-browser) t))
;; enable inline images
(setq mu4e-view-show-images t)
;; use imagemagick, if available
(when (fboundp 'imagemagick-register-types)
  (imagemagick-register-types))


;; every new email composition gets its own frame!
(setq mu4e-compose-in-new-frame t)

;; don't save message to Sent Messages, IMAP takes care of this
(setq mu4e-sent-messages-behavior 'delete)

(add-hook 'mu4e-view-mode-hook #'visual-line-mode)

;; <tab> to navigate to links, <RET> to open them in browser
(add-hook 'mu4e-view-mode-hook
          (lambda()
            ;; try to emulate some of the eww key-bindings
            (local-set-key (kbd "<RET>") 'mu4e~view-browse-url-from-binding)
            (local-set-key (kbd "<tab>") 'shr-next-link)
            (local-set-key (kbd "<backtab>") 'shr-previous-link)))

;; (set-email-account! "gmail-wakemecn"
;;                     '((mu4e-sent-folder       . "/gmail-wakemecn/Sent Mail")
;;                       (mu4e-drafts-folder     . "/gmail-wakemecn/Drafts")
;;                       (mu4e-trash-folder      . "/gmail-wakemecn/Trash")
;;                       (mu4e-refile-folder     . "/gmail-wakemecn/All Mail")
;;                       (smtpmail-smtp-user     . "wakemecn@gmail.com")
;;                       (mu4e-compose-signature . "\n\nBest regards,\nJunwei Wang"))
;;                     t)

;; (set-email-account! "CRX"
;;                     '((mu4e-sent-folder       . "/CRX/Sent Mail")
;;                       (mu4e-drafts-folder     . "/CRX/Drafts")
;;                       (mu4e-trash-folder      . "/CRX/Trash")
;;                       (mu4e-refile-folder     . "/CRX/All Mail")
;;                       (smtpmail-smtp-user     . "junwei.wang@cryptoexperts.com")
;;                       (mu4e-compose-signature . "\n\nBest regards,\nJunwei Wang"))
;;                     nil)
;; convert org mode to HTML automatically
(setq org-mu4e-convert-to-html t)

;;from vxlabs config
;; show full addresses in view message (instead of just names)
;; toggle per name with M-RET
(setq mu4e-view-show-addresses 't)

;; don't ask when quitting
(setq mu4e-confirm-quit nil)

;; mu4e-context
(setq mu4e-context-policy 'pick-first)
(setq mu4e-compose-context-policy 'always-ask)

;;set up queue for offline email
;;use mu mkdir  ~/.maildir/$ACCOUNT/queue to set up first
(setq smtpmail-queue-mail nil)  ;; start in normal mode

(after! mu4e-context
  :config
  (setq mu4e-contexts
        (list
         (make-mu4e-context
          :name "wakemecn" ;;for gmail-wakemecn
          :enter-func (lambda () (mu4e-message "Entering context [wakemecn]"))
          :leave-func (lambda () (mu4e-message "Leaving context [wakemecn]"))
          :match-func (lambda (msg)
                        (when msg
                          (mu4e-message-contact-field-matches
                           msg '(:from :to :cc :bcc) "wakemecn@gmail.com")))
          :vars '((user-mail-address . "wakemecn@gmail.com")
                  (user-full-name . "Junwei Wang")
                  (mu4e-sent-folder . "/gmail-wakemecn/Sent Mail")
                  (mu4e-drafts-folder . "/gmail-wakemecn/drafts")
                  (mu4e-trash-folder . "/gmail-wakemecn/Trash")
                  (mu4e-compose-signature . (concat "Formal Signature\n" "Emacs 27.1, org-mode 10, mu4e 1.4\n"))
                  (mu4e-compose-format-flowed . t)
                  (smtpmail-queue-dir . "~/.maildir/gmail-wakemecn/queue/cur")
                  (message-send-mail-function . smtpmail-send-it)
                  (smtpmail-smtp-user . "wakemecn")
                  (smtpmail-starttls-credentials . (("smtp.gmail.com" 587 nil nil)))
                  (smtpmail-auth-credentials . (expand-file-name "~/.authinfo.gpg"))
                  (smtpmail-default-smtp-server . "smtp.gmail.com")
                  (smtpmail-smtp-server . "smtp.gmail.com")
                  (smtpmail-smtp-service . 587)
                  (smtpmail-debug-info . t)
                  (smtpmail-debug-verbose . t)
                  (mu4e-maildir-shortcuts . ( ("/gmail-wakemecn/INBOX"     . ?i)
                                              ("/gmail-wakemecn/Sent Mail" . ?s)
                                              ("/gmail-wakemecn/Trash"     . ?t)
                                              ("/gmail-wakemecn/All Mail"  . ?a)
                                              ("/gmail-wakemecn/Starred"   . ?r)
                                              ("/gmail-wakemecn/drafts"    . ?d)
                                              ))))
         (make-mu4e-context
          :name "CRX" ;; for CRX mail
          :enter-func (lambda () (mu4e-message "Entering context [CRX]"))
          :leave-func (lambda () (mu4e-message "Leaving context [CRX]"))
          :match-func (lambda (msg)
                        (when msg
                          (mu4e-message-contact-field-matches
                           msg '(:from :to :cc :bcc) "junwei.wang@cryptoexperts.com")))
          :vars '((user-mail-address . "junwei.wang@cryptoexperts.com")
                  (user-full-name . "Junwei Wang")
                  (mu4e-sent-folder . "/CRX/Sent Mail")
                  (mu4e-drafts-folder . "/CRX/drafts")
                  (mu4e-trash-folder . "/CRX/Trash")
                  (mu4e-compose-signature . (concat "Informal Signature\n" "Emacs is awesome!\n"))
                  (mu4e-compose-format-flowed . t)
                  (smtpmail-queue-dir . "~/.maildir/CRX/queue/cur")
                  (message-send-mail-function . smtpmail-send-it)
                  (smtpmail-smtp-user . "junwei.wang@cryptoexperts.com")
                  (smtpmail-starttls-credentials . (("smtp.gmail.com" 587 nil nil)))
                  (smtpmail-auth-credentials . (expand-file-name "~/.authinfo.gpg"))
                  (smtpmail-default-smtp-server . "smtp.gmail.com")
                  (smtpmail-smtp-server . "smtp.gmail.com")
                  (smtpmail-smtp-service . 587)
                  (smtpmail-debug-info . t)
                  (smtpmail-debug-verbose . t)
                  (mu4e-maildir-shortcuts . ( ("/CRX/INBOX"     . ?i)
                                              ("/CRX/Sent Mail" . ?s)
                                              ("/CRX/Trash"     . ?t)
                                              ("/CRX/All Mail"  . ?a)
                                              ("/CRX/Starred"   . ?r)
                                              ("/CRX/drafts"    . ?d)
                                              )))))))
#+end_src


** Doom configuration

*** Modules
:PROPERTIES:
:header-args:emacs-lisp: :tangle no
:END:

#+name: init.el
#+begin_src emacs-lisp :tangle "init.el" :noweb no-export :comments none
;;; init.el -*- lexical-binding: t; -*-

;; This file controls what Doom modules are enabled and what order they load
;; in. Remember to run 'doom sync' after modifying it!

;; NOTE Press 'SPC h d h' (or 'C-h d h' for non-vim users) to access Doom's
;;      documentation. There you'll find a "Module Index" link where you'll find
;;      a comprehensive list of Doom's modules and what flags they support.

;; NOTE Move your cursor over a module's name (or its flags) and press 'K' (or
;;      'C-c c k' for non-vim users) to view its documentation. This works on
;;      flags as well (those symbols that start with a plus).
;;
;;      Alternatively, press 'gd' (or 'C-c c d') on a module to browse its
;;      directory (for easy access to its source code).

(doom! :input
       <<doom-input>>

       :completion
       <<doom-completion>>

       :ui
       <<doom-ui>>

       :editor
       <<doom-editor>>

       :emacs
       <<doom-emacs>>

       :term
       <<doom-term>>

       :checkers
       <<doom-checkers>>

       :tools
       <<doom-tools>>

       :os
       <<doom-os>>

       :lang
       <<doom-lang>>

       :email
       <<doom-email>>

       :app
       <<doom-app>>

       :config
       literate
       (default +bindings +smartparens))
#+end_src

